Repository: kevintrautv/pa-neni-crypto
Catalog: crypto.Desktop.Console/Recources/Strings.*.resx
Languages: de

# ProgressBar_PrintProgressBar_Progress___0___1_
source: Progress: {0}/{1}
de: Fortschritt: {0}/{1}

# ProgressBar_PrintProgressBar__0__Failed___1_
source: {0} Failed: {1}
de: {0} Fehlgeschlagen: {1}

# UnlockCommandAsync_Run_Vault_unlocked_
source: Vault unlocked.
de: Vault aufgeschlossen.

# UnlockCommandAsync_Run_File_has_been_altered
source: File: {0} has been altered, be careful with this file.
de: Die Datei {0} wurde verändert, seinen sie vorsichtig mit dieser Datei.

# UnlockCommandAsync_ExtractAllFiles_Error_unlocking_file__0____1_
source: Error unlocking file {0}: {1}
de: Fehler beim aufschließen der Datei {0}: {1}

# RenameCommand_Run_The_file_to_rename_wasn_t_found
source: The file to rename wasn't found.
de: Die Datei zur umbennenung nicht gefunden.

# RenameCommand_Run_File_renamed_to_
source: File renamed to
de: Datei umbenannt zu

# RenameCommand_RenameCommand_No_path_to_vault_given
source: No path to vault given.
de: Kein Pfad zum Vault gegeben.

# RenameCommand_RenameCommand_No_path_to_file_given
source: No path to file given.
de: Kein Pfad zur Datei gegeben.

# RenameCommand_RenameCommand_No_new_name_given
source: No new name given.
de: Kein neuer Name gegeben.

# Program_Main_Something_went_wrong__
source: Something went wrong:
de: Etwas ist schiefgelaufen:

# Program_Main_No_console_arguments_given
source: No console arguments given.
de: Keine Konsolenargumente gegeben.

# PasswordPrompt_PromptPassword_Enter_Password__
source: Enter Password:
de: Kennwort eingeben:

# PasswordPrompt_PromptPasswordWithConfirmation_Password_didn_t_match_up
source: Password didn't match up.
de: Kennwort stimmte nicht überein.

# PasswordPrompt_PromptPasswordWithConfirmation_Confirm_Password__
source: Confirm Password:
de: Kennwort bestätigen:

# NewCommandAsync_Run_The_directory_vault_is_not_empty
source: The directory with the vault name is not empty.
de: Der Ordner mit den Namen vom Vault ist nicht leer.

# NewCommandAsync_Run_Created_vault__0__as__1__
source: Created vault {0} as {1}
de: Vault {0} erstellt in {1}

# MoveCommand_Run_File_moved_to_
source: File moved to
de: Datei bewegt in

# MoveCommand_MoveCommand_No_new_path_given
source: No new path given.
de: Kein neuer Pfad gegeben.

# LockCommand_Run_Locking_files___
source: Locking files...
de: Schließe Dateien...

# LockCommand_Run_Locked_all_files_in_Vault_
source: Locked all files in Vault.
de: Alle Dateien im Vault verschlossen.

# LockCommand_LockAllFiles_Updating_file_
source: Updating file
de: Aktualisiere die Datei

# LockCommand_LockAllFiles_Error_locking_file__0____1_
source: Error locking file {0}: {1}
de: Fehler beim verschließen der Datei {0}: {1}

# DeleteCommand_Run_Deleted_file_
source: Deleted file {0}.
de: Datei {0} gelöscht.

# CommandLineArgumentParser_ParseConfig_No_arguments_given
source: No arguments given.
de: Keine Argumente gegeben.

# CommandLineArgumentParser_ParseConfig_Argument_was_not_recognized
source: Argument was not recognized.
de: Arguement wurde nicht erkannt.

# AddCommandAsync_AddDirectory_Added_directory__0__to_vault
source: Added directory {0} to vault.
de: Ordner {0} im Vault hinzugefügt.

# AddCommandAsync_AddDirectory_Error_with_file__0____1_
source: Error with file {0}: {1}
de: Fehler mit Datei {0}: {1}

# AddCommandAsync_Run_Added_file__0__to_vault
source: Added file {0} to vault.
de: Datei {0} wurde dem Vault hinzugefügt.

# HelpText
source: Neni-Crypto Help <Not implemented in english> Neni-Crypto Hilfe <> - benötigt () - Optional Beispiel: crp -pw asdf123 add BeispielVault ../datei.dat Argument: -pw <Kennwort> überspringt die Kennworteingabe mit dem gegebenen Kennwort Anweisungen: new (Name) (Pfad) – erstellt einen neuen Vault mit dem gegebenen Namen. add <Pfad zum Vault> <Pfad> - fügt eine oder mehrere Dateien oder Ordner dem Vault hinzu. unlock (Pfad zum Vault) - Entschlüsselt alles im Vault. lock (Pfad zum Vault) - Löscht jede Datei, welche im Vault entschlüsselt wurde. Dateien, welche verändert wurden, werden aktualisiert. mv <Pfad zum Vault> <Kompletter Name einer Datei im Vault> <Neuer Ort> - Verschiebt die Datei an einem anderen Ort. rn <Pfad zum Vault> <Kompletter Name einer Datei im Vault> <Neuer Name> - Gibt der Datei einen neuen Namen. del <Pfad zum Vault> <Kompletter Name einer Datei im Vault> - Löscht die Datei vom Vault. list <Pfad zum Vault> - Listet alle Dateien im Vault, nützlich in Verbindung mit mv, rn und del.
de: Neni-Crypto Hilfe <> - benötigt () - Optional Beispiel: crp -pw asdf123 add BeispielVault ../datei.dat Argument: -pw <Kennwort> überspringt die Kennworteingabe mit dem gegebenen Kennwort Anweisungen: new (Name) (Pfad) – erstellt einen neuen Vault mit dem gegebenen Namen. add <Pfad zum Vault> <Pfad> - fügt eine oder mehrere Dateien oder Ordner dem Vault hinzu. unlock (Pfad zum Vault) - Entschlüsselt alles im Vault. lock (Pfad zum Vault) - Löscht jede Datei, welche im Vault entschlüsselt wurde. Dateien, welche verändert wurden, werden aktualisiert. mv <Pfad zum Vault> <Kompletter Name einer Datei im Vault> <Neuer Ort> - Verschiebt die Datei an einem anderen Ort. rn <Pfad zum Vault> <Kompletter Name einer Datei im Vault> <Neuer Name> - Gibt der Datei einen neuen Namen. del <Pfad zum Vault> <Kompletter Name einer Datei im Vault> - Löscht die Datei vom Vault. list <Pfad zum Vault> - Listet alle Dateien im Vault, nützlich in Verbindung mit mv, rn und del.
